/********************************************************************
	【香港地下鉄向け自動列車放送制御装置】
*-------------------------------------------------------------------*
	Ｉ／Ｏ入力制御モジュール
*-------------------------------------------------------------------*
	Author		TOA Corporation

	Revision	a00. 2000/06/27		K.Honda

*********************************************************************/

#include <stdio.h>

#include "IOFUNC.h"

#include "COMMDEF.h"

/*@@@S*/
/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	グローバル変数
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

/** スイッチデータ **/
short	nowReadIO;

/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	ローカル定数定義
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/


/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	ローカル構造体定義
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	ローカルテーブル
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/


/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
		外部参照
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

/** 送信エリア **/
extern	struct PAASEND	sendarea;


/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
		ローカル変数
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/
static	char	readCount;
static	short	preReadIO;

/*@@@E*/
/************************************************************************

	Function name	<< paaSignalIn >>
					信号状態入力処理
	Syntax			paaSignalIn( void );
	Argument		none
	Author			TOA Corporation  K.Honda
	Revision		a00 2000/06/27

*************************************************************************/
void paaSignalIn( void )
{
		short	readIO;

		readIO = switch_read();

		if( readIO!=preReadIO ){
			readCount = 0;
		}
		else {
			readCount++;
			if( readCount>=5 ){	/* 50mS 経過しても同一のとき */
				readCount = 0;

				nowReadIO = readIO;

				sendarea.rscsw = nowReadIO & 0x1F;	/*非常通報スイッチを通信エリアへ設定*/
			}
		}
		preReadIO = readIO;
}

/************************************************************************

	Function name	<< paaSignalOut >>
					Ｉ／Ｏ出力処理
	Syntax			paaSignalOut( void );
	Argument		none
	Author			TOA Corporation  K.Honda
	Revision		a00 2000/06/27

*************************************************************************/
void paaSignalOut( void )
{
}

