/********************************************************************
	【香港地下鉄向け自動列車放送制御装置】
*-------------------------------------------------------------------*
	通信制御モジュール
*-------------------------------------------------------------------*
	Author		TOA Corporation

	Revision	a00. 2000/06/27		K.Honda

*********************************************************************/

#include "IOFUNC.h"

#include "COMMDEF.h"

/*@@@S*/
/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	グローバル変数
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	ローカル定数定義
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/


/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	ローカル構造体定義
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
	ローカルテーブル
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

static	const	char	col_pos[] =
{
		0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,
		0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F
};

/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
		外部参照
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

/*・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・
		ローカル変数
・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・・*/

static	char	colCount;					/*カラムカウンター*/


/*@@@E*/
/************************************************************************

	Function name	<< timer_1_func >>
					１０ｍＳタイマー割り込み処理
	Syntax			timer_1_func( void );
	Argument		none
	Author			TOA Corporation  K.Honda
	Revision		a00 2000/06/27

*************************************************************************/
void timer_1_func( void )
{
extern	void mcpSwitchIn( void );
extern	void mcpBlinkCount( void );

		mcpSwitchIn();
		mcpBlinkCount();
}

/************************************************************************

	Function name	<< timer_0_func >>
					１ｍＳタイマー割り込み処理
	Syntax			timer_0_func( void );
	Argument		none
	Author			TOA Corporation  K.Honda
	Revision		a00 2000/06/27

*************************************************************************/
void timer_0_func( void )
{
		io_disp_set( colCount );

		colCount++;
		colCount&=0x0F;			/*カラムカウンターを０から１５で進める*/
}

